Config/Catalogs/DiscountCards.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>DiscountCards</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>LoyaltyType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LoyaltyType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ClientTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Identifier</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlocked</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlockedAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlockedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Consumer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SourcesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TurnOffAutomaticDiscounts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Folio</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateHotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDiscountCard</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DiscountCards</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/LoyaltyType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>LoyaltyType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Bonuses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Certificate</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Discount</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/DiscountCards/Forms/mcListForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Not cmCheckUserPermissions("HavePermissionToManagePrices") Then
		Items.List.ChangeRowSet = False;
	EndIf;
	SetFormAppearance();
	ChangeModeList.Clear();
	ChangeModeList.Add(0, NStr("en = 'All'; de = 'Alle'; ru = 'Все'"));
	ChangeModeList.Add(1, NStr("en = 'Bonuses'; de = 'Boni'; ru = 'Бонусы'"));
	ChangeModeList.Add(2, NStr("en = 'Gift cards'; de = 'Geschenkkarten'; ru = 'Подарочные карты'"));
	ChangeModeList.Add(3, NStr("en = 'Discounts'; de = 'Ermäßigungen'; ru = 'Скидки'"));
	vItem = ChangeModeList.FindByValue(Mode);
	If vItem <> Undefined Then
		Items.ChangeMode.Title = vItem.Presentation;
	EndIf;
EndProcedure // OnCreateAtServer

#EndRegion

#Region Private

// --------------------------------------------------------------------------------
Procedure SetFormAppearance()
	If Mode = 0 Then
		// All
		tcCommonFunctionOnClientServer.cmChangeFilterItems(List.SettingsComposer.Settings.Filter,"LoyaltyType",,,,False);
	ElsIf Mode = 1 Then
		// Bonuses
		tcCommonFunctionOnClientServer.cmChangeFilterItems(List.SettingsComposer.Settings.Filter,"LoyaltyType",,Enums.LoyaltyType.Bonuses,,True);
	ElsIf Mode = 2 Then
		// Gift cards
		tcCommonFunctionOnClientServer.cmChangeFilterItems(List.SettingsComposer.Settings.Filter,"LoyaltyType",,Enums.LoyaltyType.Certificate,,True);
	ElsIf Mode = 3 Then
		// Discounts
		tcCommonFunctionOnClientServer.cmChangeFilterItems(List.SettingsComposer.Settings.Filter,"LoyaltyType",,Enums.LoyaltyType.Discount,,True);
	Else
		tcCommonFunctionOnClientServer.cmChangeFilterItems(List.SettingsComposer.Settings.Filter,"LoyaltyType",,Enums.LoyaltyType.Bonuses,,True);
	EndIf;
EndProcedure

// --------------------------------------------------------------------------------
&AtClient
Procedure ListBeforeAddRow(pItem, pCancel, pClone, pParent, pFolder, pParameter)
	If Not pClone Then
		pCancel = True;
		vLoyaltyType = Undefined;
		If Mode > 0 Then
			If Mode = 1 Then
				vLoyaltyType = PredefinedValue("Enum.LoyaltyType.Bonuses");
			ElsIf Mode = 2 Then
				vLoyaltyType = PredefinedValue("Enum.LoyaltyType.Certificate");
			ElsIf Mode = 3 Then
				vLoyaltyType = PredefinedValue("Enum.LoyaltyType.Discount");
			EndIf;
		Else
			vLoyaltyType = PredefinedValue("Enum.LoyaltyType.Certificate");
		EndIf;
		OpenForm("Catalog.DiscountCards.ObjectForm", New Structure("FillingValues", New Structure("Parent, LoyaltyType", pParent, vLoyaltyType)));
	EndIf;
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure ChangeMode(pCommand)
	vNotifyDescription = New NotifyDescription("ChangeModeAfterChoice", ThisForm);
	vParams = New Structure("ValueList, MultipleChoice, Title", ChangeModeList, False);
	OpenForm("CommonForm.mcChoiceValueList", vParams, ThisForm, UUID,,,vNotifyDescription);
EndProcedure // ChangeMode

// -----------------------------------------------------------------------------
&AtClient
Procedure ChangeModeAfterChoice(pItem, pExtraParameters) Export
	If pItem <> Undefined Then
		Mode = pItem.Value;
		Items.ChangeMode.Title = pItem.Presentation;
		SetFormAppearance();
	EndIf;
EndProcedure // FilterStatusListAfterChoice

// -----------------------------------------------------------------------------
&AtClient
Procedure ShowFiletGroup(pCommand)
	Items.ListSettingsComposerUserSettings.Visible = Not Items.ListSettingsComposerUserSettings.Visible; 
	Items.FormShowFiletGroup.Check = Items.ListSettingsComposerUserSettings.Visible;
EndProcedure // ShowFiletGroup

#EndRegion
